local aeris = {
  -- Фоны — от самого тёмного к светлому
  bg         = "#080807", -- основной фон редактора
  bg_subtle  = "#0d0c0a", -- сайдбар, neotree
  bg_raised  = "#121110", -- cursorline, выделения
  bg_overlay = "#171614", -- popup, float окна
  bg_border  = "#1c1b18", -- бордеры, разделители
  bg_active  = "#21201c", -- активные элементы UI

  -- Текст — от самого тёмного к светлому
  fg         = "#f2ede6", -- основной текст
  fg_muted   = "#807e74", -- комментарии, второстепенный текст
  fg_subtle  = "#595855", -- операторы, пунктуация
  fg_ghost   = "#302e28", -- номера строк, почти невидимый

  -- Акценты
  pink       = "#F2BAC9",
  red        = "#F2A0A8",
  aqua       = "#BAF2E9",
  blue       = "#BAD7F2",
  green      = "#B0F2B4",
  peach      = "#F2E2BA",
}

return aeris
